example.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
  plugins:
    faker:
      locale: de
  variables:
    title: '$faker.name.title'
    firstName: '$faker.name.firstName'
    lastName: '$faker.name.lastName'

scenarios:
  - flow:
    - get:
        url: "/search?q={{ lastName }}"
  - flow:
    - get:
        url: "/search?q={{ firstName }}"
  - flow:
    - get:
        url: "/search?q={{ firstName }} {{ lastName }}"