example.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
  plugins:
    faker:
      locale: en
  variables:
    firstName: "$faker.name.firstName"
    lastName: "$faker.name.lastName"

scenarios:
  - flow:
      - log: "lastName: {{ lastName }}"
      - get:
          url: "/search?q={{ lastName }}"
  - flow:
      - log: "firstName: {{ firstName }}"
      - get:
          url: "/search?q={{ firstName }}"
  - flow:
      - log: "fullName: {{ firstName }} {{ lastName }}"
      - get:
          url: "/search?q={{ firstName }} {{ lastName }}"